neohung/stm32_examples/test_stm/src/main.c
#include <stdio.h>
#include <stdlib.h>
#include <stdint.h>
#include <math.h>

#include "stm32f4xx_conf.h"
#include "stm32f4xx.h"
#include "main.h"

#include "cmsis_os.h"
#include "FreeRTOSConfig.h"
#include "FreeRTOS.h"
#include "task.h"
#include "timers.h"
#include "queue.h"
#include "semphr.h"
#include "event_groups.h"

#include "usb_core.h" //in USB_OTG

#include "queue.h"

#include "ringbuf.h"
queue_t data_in;
//queue_t data_out;
queue_t commands;
ringbuf_t data_out;

#define USB_USBHID 0

__ALIGN_BEGIN USB_OTG_CORE_HANDLE  USB_OTG_dev __ALIGN_END;

// Private function prototypes
void Delay(volatile uint32_t nCount);

void tim8pwm_init() //PC6/PC7PC8/PC9
{
	  GPIO_InitTypeDef GPIO_InitStructure;
	  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC,ENABLE);
	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7 | GPIO_Pin_8 | GPIO_Pin_9;
	  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;

	  GPIO_Init(GPIOC,&GPIO_InitStructure);

	  GPIO_PinAFConfig(GPIOC,GPIO_PinSource6,GPIO_AF_TIM8);
	  GPIO_PinAFConfig(GPIOC,GPIO_PinSource7,GPIO_AF_TIM8);
	  GPIO_PinAFConfig(GPIOC,GPIO_PinSource8,GPIO_AF_TIM8);
	  GPIO_PinAFConfig(GPIOC,GPIO_PinSource9,GPIO_AF_TIM8);

	  //SystemCoreClock = 168000000;
	  ////timer_tick_frequency = 168000000 / ( Prescaler + 1) = 25000Hz
	  //25000
	  int Prescaler =  (SystemCoreClock / 250) - 1;
	  // 4ms=250Hz => 25000Hz/250Hz = 100
	  // 250/100 = 2.5Hz , 1/2.5 = 400ms
	  int TimerPeriod =  100 ;
	  int  ccr1 = 0;//TimerPeriod / 2;
	  int  ccr2 = 0;//TimerPeriod / 2;
	  int  ccr3 = 0;//TimerPeriod / 2;
	  int  ccr4 = 0;//TimerPeriod / 2;

	    RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM8,ENABLE);
	    TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;

	    TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;
	    TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;
	    TIM_TimeBaseInitStructure.TIM_Prescaler = Prescaler;
	    TIM_TimeBaseInitStructure.TIM_RepetitionCounter = 0;
	    TIM_TimeBaseInitStructure.TIM_Period = TimerPeriod - 1;
	    TIM_TimeBaseInit(TIM8,&TIM_TimeBaseInitStructure);

	    TIM_OCInitTypeDef TIM_OCInitStructure = {0,};
	    TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
	    TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	    TIM_OCInitStructure.TIM_OutputNState = TIM_OutputNState_Enable;
	    TIM_OCInitStructure.TIM_Pulse = ccr1;
	    TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
	    TIM_OCInitStructure.TIM_OCNPolarity = TIM_OCPolarity_High;
	    TIM_OCInitStructure.TIM_OCIdleState = TIM_OCIdleState_Set;
	    TIM_OCInitStructure.TIM_OCNIdleState = TIM_OCNIdleState_Reset;

	    TIM_OC1Init(TIM8,&TIM_OCInitStructure);

	    TIM_OCInitStructure.TIM_Pulse = ccr2;
	    TIM_OC2Init(TIM8,&TIM_OCInitStructure);

	    TIM_OCInitStructure.TIM_Pulse = ccr3;
	    TIM_OC3Init(TIM8,&TIM_OCInitStructure);

	    TIM_OCInitStructure.TIM_Pulse = ccr4;
	    TIM_OC4Init(TIM8,&TIM_OCInitStructure);

	    TIM_Cmd(TIM8,ENABLE);
	    TIM_CtrlPWMOutputs(TIM8,ENABLE);   //TIM1 and TIM8 need to exec this function
}

void uart2_init()
{
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);
	GPIO_InitTypeDef  GPIO_InitStructure;
	//PA9 TX / PA10 RX
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5 | GPIO_Pin_6;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_Init(GPIOD, &GPIO_InitStructure);
	//
	USART_InitTypeDef USART_InitStructure;
	USART_InitStructure.USART_BaudRate = 115200;
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;
	USART_InitStructure.USART_StopBits = USART_StopBits_1;
	USART_InitStructure.USART_Parity = USART_Parity_No;
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
	USART_Init(USART2, &USART_InitStructure);
	USART_Cmd(USART2, ENABLE);
}

void uart1_init()
{
		USART_InitTypeDef USART_InitStruct;
		GPIO_InitTypeDef GPIO_InitStruct, GPIO_InitStruct2;
	    NVIC_InitTypeDef NVIC_InitStruct;

	    RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1,ENABLE);
	    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB,ENABLE);

	    GPIO_InitStruct.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7;
	    GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF;
	    GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
	    GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
	    GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_NOPULL;//GPIO_PuPd_UP;
	    GPIO_Init(GPIOB,&GPIO_InitStruct);
	    GPIO_PinAFConfig(GPIOB,GPIO_PinSource6,GPIO_AF_USART1);
	    GPIO_PinAFConfig(GPIOB,GPIO_PinSource7,GPIO_AF_USART1);

	    USART_InitStruct.USART_WordLength = USART_WordLength_8b;
	    USART_InitStruct.USART_BaudRate = 115200;
	    USART_InitStruct.USART_StopBits = USART_StopBits_1;
	    USART_InitStruct.USART_Parity = USART_Parity_No;
	    USART_InitStruct.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	    USART_InitStruct.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
	    USART_Init(USART1,&USART_InitStruct);
	    USART_ITConfig(USART1,USART_IT_RXNE,ENABLE);

	    NVIC_InitStruct.NVIC_IRQChannel = USART1_IRQn;
	    NVIC_InitStruct.NVIC_IRQChannelPreemptionPriority = 0;
	    NVIC_InitStruct.NVIC_IRQChannelSubPriority = 0;
	    NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
	    NVIC_Init(&NVIC_InitStruct);

	    USART_Cmd(USART1,ENABLE);
}

void USART1_puts(volatile char* s)
{
    while(*s)
    {
        while(!(USART1->SR & 0x00000040)){
        }
        USART_SendData(USART1,*s);
        *s++;
    }
}



/*
void USART1_IRQHandler(void)
{
	int MAX_STRLEN = 128;
    int i = 0;
    if(USART_GetITStatus(USART1, USART_IT_RXNE) != RESET)
    {
        static uint8_t cnt = 0;
        char t = USART_ReceiveData(USART1);
        //USART1_putch(t);
        if((t!='n')&&(cnt < MAX_STRLEN))
        {
            //received_string[cnt] = t;
            cnt++;
        }else{
            cnt = 0;
            //USART1_puts(received_string);
            //for (i = 0; i <= MAX_STRLEN+1; i++)         // flush buffer
            //received_string[i] = '\0';
        }
    }
}
*/

void USART_puts(USART_TypeDef* USARTx, volatile char *s){

    while(*s){
        // wait until data register is empty
        while( !(USARTx->SR & 0x00000040) );
        USART_SendData(USARTx, *s);
        *s++;
    }
}

void USART1_IRQHandler(void){
	int MAX_STRLEN=12;
    // check if the USART1 receive interrupt flag was set
    if( USART_GetITStatus(USART1, USART_IT_RXNE) ){

        static uint8_t cnt = 0; // this counter is used to determine the string length
        char t = USART1->DR; // the character from the USART1 data register is saved in t

        if( (t != '\n') && (cnt < MAX_STRLEN) ){
            //received_string[cnt] = t;
            cnt++;
        }
        else{ // otherwise reset the character counter and print the received string
            cnt = 0;
            USART_puts(USART1, 'A');
            //USART_puts(USART1, "\n");
            //memset(received_string, 0, MAX_STRLEN+1);
        }
    }
}
void init_USART1(uint32_t baudrate){

    GPIO_InitTypeDef GPIO_InitStruct;                       // this is for the GPIO pins used as TX and RX
    USART_InitTypeDef USART_InitStruct;                     // this is for the USART1 initilization
    NVIC_InitTypeDef NVIC_InitStructure;                    // this is used to configure the NVIC (nested vector interrupt controller)

    RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);  // Peripheral clock for USART1 (APB2) --> other USART uses APB1
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);   // Peripheral clock for GPIOB (PB6 = TX, PB7 = RX)

    GPIO_InitStruct.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7;     // Pins 6 (TX) and 7 (RX) are used
    GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF;               // the pins are configured as alternate function so the USART peripheral has access to them
    GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;          // this defines the IO speed and has nothing to do with the baudrate!
    GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;             // this defines the output type as push pull mode (as opposed to open drain)
    GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_UP;               // this activates the pullup resistors on the IO pins
    GPIO_Init(GPIOB, &GPIO_InitStruct);                     // now all the values are passed to the GPIO_Init() function which sets the GPIO registers

    /* The RX and TX pins are now connected to their AF
     * so that the USART1 can take over control of the
     * pins
     */
    GPIO_PinAFConfig(GPIOB, GPIO_PinSource6, GPIO_AF_USART1);
    GPIO_PinAFConfig(GPIOB, GPIO_PinSource7, GPIO_AF_USART1);

    /* Now the USART_InitStruct is used to define the
     * properties of USART1
     */
    USART_InitStruct.USART_BaudRate = baudrate;             // the baudrate is set to the value we passed into this init function
    USART_InitStruct.USART_WordLength = USART_WordLength_8b;// we want the data frame size to be 8 bits (standard)
    USART_InitStruct.USART_StopBits = USART_StopBits_1;     // we want 1 stop bit (standard)
    USART_InitStruct.USART_Parity = USART_Parity_No;        // we don't want a parity bit (standard)
    USART_InitStruct.USART_HardwareFlowControl = USART_HardwareFlowControl_None; // we don't want flow control (standard)
    USART_InitStruct.USART_Mode = USART_Mode_Tx | USART_Mode_Rx; // we want to enable the transmitter and the receiver
    USART_Init(USART1, &USART_InitStruct);                  // again all the properties are passed to the USART_Init function which takes care of all the bit setting

