neohung/stm32_examples/test_stm/src/main.c
    USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);          // enable the USART1 receive interrupt

    NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn;       // we want to configure the USART1 interrupts
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;// this sets the priority group of the USART1 interrupts
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;      // this sets the subpriority inside the group
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;         // the USART1 interrupts are globally enabled
    NVIC_Init(&NVIC_InitStructure);                         // the properties are passed to the NVIC_Init function which takes care of the low level stuff

    USART_Cmd(USART1, ENABLE);                              // This enables the complete USART1 peripheral
}


void uart3_init()
{
		USART_InitTypeDef USART_InitStruct;
		GPIO_InitTypeDef GPIO_InitStruct;
	    NVIC_InitTypeDef NVIC_InitStruct;

	    RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3,ENABLE);
	    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB,ENABLE);

	    GPIO_InitStruct.GPIO_Pin = GPIO_Pin_10 | GPIO_Pin_11;
	    GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF;
	    GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
	    GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
	    GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_NOPULL;//GPIO_PuPd_UP;
	    GPIO_Init(GPIOB,&GPIO_InitStruct);
	    GPIO_PinAFConfig(GPIOB,GPIO_PinSource10,GPIO_AF_USART3);
	    GPIO_PinAFConfig(GPIOB,GPIO_PinSource11,GPIO_AF_USART3);

	    USART_InitStruct.USART_WordLength = USART_WordLength_8b;
	    USART_InitStruct.USART_BaudRate = 115200;
	    USART_InitStruct.USART_StopBits = USART_StopBits_1;
	    USART_InitStruct.USART_Parity = USART_Parity_No;
	    USART_InitStruct.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	    USART_InitStruct.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
	    USART_Init(USART3,&USART_InitStruct);
	    USART_ITConfig(USART3,USART_IT_RXNE,ENABLE);

	    NVIC_InitStruct.NVIC_IRQChannel = USART3_IRQn;
	    NVIC_InitStruct.NVIC_IRQChannelPreemptionPriority = 0;
	    NVIC_InitStruct.NVIC_IRQChannelSubPriority = 0;
	    NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
	    NVIC_Init(&NVIC_InitStruct);

	    USART_Cmd(USART3,ENABLE);
}

void init() {
	GPIO_InitTypeDef  GPIO_InitStructure;
	// ---------- SysTick timer -------- //
	if (SysTick_Config(SystemCoreClock / 1000)) {
		// Capture error
		while (1){};
	}
	// ---------- GPIO -------- //
	// GPIOD Periph clock enable
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);
	// Configure PD12, PD13, PD14 and PD15 in output pushpull mode
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12 | GPIO_Pin_13| GPIO_Pin_14| GPIO_Pin_15;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_Init(GPIOD, &GPIO_InitStructure);
	//-----------USER BTN (PA0)---------
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);
    // Clock for SYSCFG
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);
    // GPIOA initialization as an input from user button (GPIOA0)
    GPIO_InitTypeDef GPIO_InitStruct;
    GPIO_InitStruct.GPIO_Mode = GPIO_Mode_IN;
    GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
    GPIO_InitStruct.GPIO_Pin = GPIO_Pin_0;
    GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_DOWN;
    GPIO_InitStruct.GPIO_Speed = GPIO_Speed_2MHz;
    GPIO_Init(GPIOA, &GPIO_InitStruct);
    /*
    // Selects the GPIOA pin 0 used as external interrupt source
    SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOA, EXTI_PinSource0);
    // External interrupt settings
    EXTI_InitTypeDef EXTI_InitStruct;
    EXTI_InitStruct.EXTI_Line = EXTI_Line0;
    EXTI_InitStruct.EXTI_LineCmd = ENABLE;
    EXTI_InitStruct.EXTI_Mode = EXTI_Mode_Interrupt;
    EXTI_InitStruct.EXTI_Trigger = EXTI_Trigger_Rising;
    EXTI_Init(&EXTI_InitStruct);

    // Nested vectored interrupt settings
    NVIC_InitTypeDef NVIC_InitStruct;
    NVIC_InitStruct.NVIC_IRQChannel = EXTI0_IRQn;
    NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
    // EXTI0_IRQn has Most important interrupt
    NVIC_InitStruct.NVIC_IRQChannelPreemptionPriority = 0x00;
    NVIC_InitStruct.NVIC_IRQChannelSubPriority = 0x00;
    NVIC_Init(&NVIC_InitStruct);
    */
    //
    //Motor_GPIO_Configuration();
    tim8pwm_init();
   // uart1_init();
    uart3_init();
    //
}

#include "hid_report_desc.h"
extern uint8_t USBD_HID_SendReport(USB_OTG_CORE_HANDLE  *pdev, uint8_t *report,uint16_t len);
struct customerHID_t customerHID;
volatile int is_user_button_press = 0;
void delay(int i)
{
	i*=1000;
	do{
	}while((i--)>0);
}

void EXTI0_IRQHandler(void)
{
	if (EXTI_GetITStatus(EXTI_Line0))
	{

		is_user_button_press = 1;
		//GPIO_SetBits(GPIOD, GPIO_Pin_14);
		 EXTI_ClearITPendingBit(EXTI_Line0);
	}

}
volatile osThreadId thread2_id = NULL;

static void Thread2(void const *arg)
{
	  while(1)
	 {
	   GPIO_SetBits(GPIOD, GPIO_Pin_13);
	   osDelay(250);
	   //
	   USART_SendData(USART3, 'A');
	   //while(!(USART1->SR & 0x00000040)){
	   //       }
	   //USART_SendData(USART1,'A');

	   //
		if (is_user_button_press){
		 is_user_button_press = 0;
		  //GPIO_ResetBits(GPIOD, GPIO_Pin_14);
		}
	  GPIO_ResetBits(GPIOD, GPIO_Pin_13);
	   osDelay(250);
	 }
}

unsigned char polling_data(void)
{
	static queue_element_t *e;
	//unsigned int tail;
	while(1){
	    //tail =
	    getNextQueueData(&data_in, &e);
	    if (e) {
	    	break;
	    }else{
	    	osDelay(1);
	    }
	};
	return e->data[0];
}

volatile osThreadId thread3_id = NULL;
volatile osThreadId thread4_id = NULL;
volatile osThreadId thread5_id = NULL;
extern __IO uint32_t uwTick;


void send_message(char* buf,unsigned int len){
	unsigned int i;
	char crc = 0xFF;
	// Pushh Magic Number
	while (!pushElement(&data_out,0xEA)) {
		osDelay(1);
	}
	//}while(!pushQueueElement(&data_out,  elem));
	crc -= 0xEA;
	//
	for(i=0;i<len;i++){
		while (!pushElement(&data_out,buf[i])) {
				osDelay(1);
		}
		crc -= buf[i];
	}
	//push crc
	//printf("Push crc: 0x%X \n",crc);
	while (!pushElement(&data_out,crc)) {
					osDelay(1);
				}
	//osDelay(15);
}

