neohung/stm32_examples/test_stm/src/main.c
static void process_data_out(void const *arg)
{
	 //queue_element_t *e = 0;
	 unsigned char* pdata;
	 //unsigned int tail;
	 while(1)
	 {
		 //printf("process_data_out\r\n");
		 //e = 0;
		 	while(1){
		 		//tail =
		 		getNextData(&data_out, &pdata);
		 	    if (pdata) {
		 	    	break;
		 	    }else{
		 	    	osDelay(1);
		 	    }
		 	};
		 	customerHID.data = *pdata;
		 	USBD_HID_SendReport(&USB_OTG_dev, (uint8_t*) &customerHID, sizeof(struct customerHID_t));
		 	osDelay(1);
	 }
}
//----------------------------------
typedef enum _OI_Opcode {
	// Command opcodes
	 OI_OPCODE_MOTORCONTROL  = 1,
	 OI_OPCODE_ODOMUPDATE = 2,
	 OI_OPCODE_QUERY = 3,
	 OI_OPCODE_IMUQUERY = 4,
	 OI_OPCODE_IMUSTATE = 5,
} OIOpcode;

//------------------------------------
static char str[12];

void oiProcessQuery(queue_element_t *e)
{
	//printf("Process Odom Query\r\n");
	int x = 0x0001; //mm
	int y = 0x0002; //mm
	int theta = 0x0003; //degree 0~360
	int linear_speed = 0x0004; //mm
	int angular_speed = 0x0005; //mm
	str[0] = OI_OPCODE_ODOMUPDATE;  // command type id
	str[1] = 10;  // len
	str[2] = x & 0xFF;
	str[3] = (x >> 8) & 0xFF;
	str[4] = y & 0xFF;
	str[5] = (y >> 8)& 0xFF;
	str[6] = theta & 0xFF;
	str[7] = (theta >> 8) & 0xFF;
	str[8] = linear_speed & 0xFF;
	str[9] = (linear_speed >> 8) & 0xFF;
	str[10] = angular_speed & 0xFF;
	str[11] = (angular_speed >> 8)& 0xFF;
	send_message(str, sizeof(str));

}
void oiProcessMotorControl(queue_element_t *e)
{
	//printf("Process Motor Control, 0x%X, 0x%X, 0x%X, 0x%X\r\n",e->data[1],e->data[2],e->data[3],e->data[4]);
	short ls = (short)(e->data[1] + (e->data[2]<<8));
	short as = (short)(e->data[3] + (e->data[4]<<8));
	printf("Process Motor Control, len: %d, ls:%d, as:%d\r\n",e->len,ls,as);
    TIM_OCInitTypeDef TIM_OCInitStructure = {0,};
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	TIM_OCInitStructure.TIM_OutputNState = TIM_OutputNState_Enable;
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
	TIM_OCInitStructure.TIM_OCNPolarity = TIM_OCPolarity_High;
	TIM_OCInitStructure.TIM_OCIdleState = TIM_OCIdleState_Set;
	TIM_OCInitStructure.TIM_OCNIdleState = TIM_OCNIdleState_Reset;

	short left_wheel_pwm = ls;
	short right_wheel_pwm = ls;
	if (as == 0){

	}else if (as > 0){
		left_wheel_pwm -= as;
		right_wheel_pwm += as;
	} else {
		left_wheel_pwm += as;
		right_wheel_pwm -= as;
	}

	if (left_wheel_pwm == 0){
		TIM_OCInitStructure.TIM_Pulse = 0;
		TIM_OC1Init(TIM8,&TIM_OCInitStructure);
		TIM_OCInitStructure.TIM_Pulse = 0;
		TIM_OC3Init(TIM8,&TIM_OCInitStructure);
	}else if (left_wheel_pwm> 0){
		TIM_OCInitStructure.TIM_Pulse = left_wheel_pwm;
		TIM_OC1Init(TIM8,&TIM_OCInitStructure);
		TIM_OCInitStructure.TIM_Pulse = 0;
		TIM_OC3Init(TIM8,&TIM_OCInitStructure);
	}else{
		TIM_OCInitStructure.TIM_Pulse = 0;
		TIM_OC1Init(TIM8,&TIM_OCInitStructure);
		TIM_OCInitStructure.TIM_Pulse = -1*left_wheel_pwm;
		TIM_OC3Init(TIM8,&TIM_OCInitStructure);
	}

	if (right_wheel_pwm == 0){
		TIM_OCInitStructure.TIM_Pulse = 0;
		TIM_OC2Init(TIM8,&TIM_OCInitStructure);
		TIM_OCInitStructure.TIM_Pulse = 0;
		TIM_OC4Init(TIM8,&TIM_OCInitStructure);
	}else if (right_wheel_pwm> 0){
		TIM_OCInitStructure.TIM_Pulse = right_wheel_pwm;
		TIM_OC2Init(TIM8,&TIM_OCInitStructure);
		TIM_OCInitStructure.TIM_Pulse = 0;
		TIM_OC4Init(TIM8,&TIM_OCInitStructure);
	}else{
		TIM_OCInitStructure.TIM_Pulse = 0;
		TIM_OC2Init(TIM8,&TIM_OCInitStructure);
		TIM_OCInitStructure.TIM_Pulse = -1*right_wheel_pwm;
		TIM_OC4Init(TIM8,&TIM_OCInitStructure);
	}
    //TIM_Cmd(TIM8,ENABLE);
    //TIM_CtrlPWMOutputs(TIM8,ENABLE);   //TIM1 and TIM8 need to exec this function

}
void oiProcessIMUQuery(queue_element_t *e)
{
	//printf("Process IMU Query\r\n");
		char str[8];
		int yaw = 0x0001; //-180~180
		int pitch = 0x0002; //-180~180
		int roll = 0x0003; //-180~180
		str[0] = OI_OPCODE_IMUSTATE;  // command type id
		str[1] = 6;  // len
		str[2] = yaw & 0xFF;
		str[3] = (yaw >> 8) & 0xFF;
		str[4] = pitch & 0xFF;
		str[5] = (pitch >> 8)& 0xFF;
		str[6] = roll & 0xFF;
		str[7] = (roll >> 8)& 0xFF;
		send_message(str, sizeof(str));
}
//------------------------------------
typedef void (*OiHandleOpcode_t)(queue_element_t *e);

typedef struct _OiCmdDispatcher{
    OIOpcode                opcode;
    OiHandleOpcode_t        func;
} OiCmdDispatcher;

OiCmdDispatcher oiOpChecker[] =
{
  {
	OI_OPCODE_MOTORCONTROL,
    oiProcessMotorControl,
  },
  {
     OI_OPCODE_QUERY,
     oiProcessQuery,
   },
   {
	 OI_OPCODE_IMUQUERY,
     oiProcessIMUQuery,
   },
};

#define NUMBER_SUPPORTED_OI_CMD sizeof(oiOpChecker)/sizeof(struct _OiCmdDispatcher)
//------------------------------------


static void process_command(void const *arg)
{
	//unsigned int tail;
	queue_element_t *e = 0;
	//unsigned char *pdata = 0;
	while(1)
	{
		  e=0;
		  //tail =
		  getNextQueueData(&commands, &e);
		  if (e) {
			  int i;
			  for(i=0;i<NUMBER_SUPPORTED_OI_CMD;i++)
			  {
			      if(oiOpChecker[i].opcode == e->data[0])
			      {
			    	   //green led
			    	   GPIO_ToggleBits(GPIOD, GPIO_Pin_12);
			    	   oiOpChecker[i].func(e);
			      }
			   }
			   osDelay(1);
		  }else{
			  osDelay(1);
		  }
	}
}

char param[256];
//queue_element_t elemarray[16];
//int index=0;
static void process_data_in(void const *arg)
{
     //printf("test\r\n");

	 while(1)
	 {
		 queue_element_t elem;
		// printf("process_data_in\r\n");
		  char checksum = 0xFF;
		  do{
		  }while(polling_data() != 0xEA);
		  checksum -= 0xEA;
		  unsigned char Command_type_id = polling_data();
		  checksum -= Command_type_id;
		  //printf("Command_type_id: %d\r\n",Command_type_id);
		  unsigned char len = polling_data();
		  checksum -= len;
		  // Check len if make sense
		  if (len > 16){
			 printf("Check len=%d error, should not longer than 16, skip this\r\n", len);
			 continue;
		  }
		     //
		  //printf("len: %d\r\n",len);
		  int i;
		  for (i=0;i<len;i++){
			  param[i] = polling_data();
			  checksum -= param[i];
		  }
		  char crc = polling_data();
		  if (crc != checksum){
			  printf("Checksum error, skip this\r\n");
			  printf("read crc=0x%X, should be 0x%X\r\n",crc,checksum);
			  continue;
		  }
		  // Pass command_type id and param[] and len


