neohung/stm32_examples/test_stm/src/main.c
		  elem.data[0] = Command_type_id;
		  for (i=0;i<len;i++){
			  elem.data[i+1]  = param[i];
		  }
		  elem.len = len+1;
		  int ret = pushQueueElement(&commands,  elem);
		  if (!ret){
			  printf("Push command error, skip this\r\n");
			  GPIO_ToggleBits(GPIOD, GPIO_Pin_14);
		  }else{
			  //index = ret;
		  }

	 }
}

extern  USBD_Usr_cb_TypeDef USR_cb;
extern  USBD_DEVICE USR_desc;
extern USBD_Class_cb_TypeDef  USBD_neo_cb;
extern void USBD_Init(USB_OTG_CORE_HANDLE *pdev, USB_OTG_CORE_ID_TypeDef coreID, USBD_DEVICE *pDevice, USBD_Class_cb_TypeDef *class_cb, USBD_Usr_cb_TypeDef *usr_cb);
volatile osThreadId main_thread_id = NULL;

static void mainUSBThread(void const *arg)
{
	// ------------- USB -------------- //
	USBD_Init(&USB_OTG_dev,
			  USB_OTG_FS_CORE_ID,       //1 means use FS, 0 use HS
			  &USR_desc,
			  &USBD_neo_cb,
			  &USR_cb);
	 osThreadDef(USER_Thread2, Thread2, osPriorityNormal, 0, configMINIMAL_STACK_SIZE);
	 thread2_id = osThreadCreate(osThread(USER_Thread2), NULL);

	 osThreadDef(USER_Thread_process_data_in, process_data_in, osPriorityNormal, 0, configMINIMAL_STACK_SIZE);
	 thread3_id = osThreadCreate(osThread(USER_Thread_process_data_in), NULL);

	 osThreadDef(USER_Thread_process_data_out, process_data_out, osPriorityNormal, 0, configMINIMAL_STACK_SIZE);
	 thread4_id = osThreadCreate(osThread(USER_Thread_process_data_out), NULL);

	 osThreadDef(USER_Thread_process_command, process_command, osPriorityNormal, 0, configMINIMAL_STACK_SIZE);
	 thread5_id = osThreadCreate(osThread(USER_Thread_process_command), NULL);


	 vTaskDelete( NULL );
}


static void mainUARTThread(void const *arg)
{
	 osThreadDef(USER_Thread2, Thread2, osPriorityNormal, 0, configMINIMAL_STACK_SIZE);
	 thread2_id = osThreadCreate(osThread(USER_Thread2), NULL);

	 osThreadDef(USER_Thread_process_command, process_command, osPriorityNormal, 0, configMINIMAL_STACK_SIZE);
	 thread5_id = osThreadCreate(osThread(USER_Thread_process_command), NULL);

	 vTaskDelete( NULL );
}

int main(void) {
	init();
	  //ledpwm_init();
   // printf("init\r\n");
	/*
	 * Disable STDOUT buffering. Otherwise nothing will be printed
	 * before a newline character or when the buffer is flushed.
	 */
	setbuf(stdout, NULL);
#if USB_USBHID
    osThreadDef(USER_Thread1, mainUSBThread, osPriorityNormal, 0, configMINIMAL_STACK_SIZE);
#else
    osThreadDef(USER_Thread1, mainUARTThread, osPriorityNormal, 0, configMINIMAL_STACK_SIZE);
#endif
    main_thread_id = osThreadCreate(osThread(USER_Thread1), NULL);
    //
    queueInit(&data_in);
    ringbufInit(&data_out);
    queueInit(&commands);
    //
    osKernelStart();
	while(1){};
	return 0;
}

/*
 * Dummy function to avoid compiler error
 */
void _init() {

}

